/****************************************************************************************************************/
/*	FILE        : bios_step_output.c																			*/
/*	DATE        :Tue, Jan 17, 2012																				*/
/*	DESCRIPTION :AGVのステッピングモータに励磁出力するモジュール												*/
/*	CPU TYPE    :H8/3052F																						*/
/****************************************************************************************************************/
#include	"machine.h"								/* 組込み関数の定義											*/
#include	"reg3052.h"								/* H8/3052Fの内蔵モジュール定義								*/
#include	"agvdef.h"								/* 無人搬送車のデバイス定義									*/

/****************************************************************************************************************/
/*	bios_step_output関数																						*/
/****************************************************************************************************************/
void bios_step_output (void)
{
	static int step = 0;
	unsigned char phase[4]={0x0c,0x06,0x03,0x09};
	static int Nphase ;
	
	STEP_PORT = phase[step];
	Nphase = phase[step];
	step++;
	if(step == 4){
		step = 0;
	}
	
}