/****************************************************************************************************************/
/*	FILE        : bios_ad_input.c																				*/
/*	DATE        :Tue, Jan 17, 2012																				*/
/*	DESCRIPTION :AGVのハンドル切れ角をA/D変換して獲得するモジュール												*/
/*	CPU TYPE    :H8/3052F																						*/
/****************************************************************************************************************/
#include	"machine.h"								/* 組込み関数の定義											*/
#include	"reg3052.h"								/* H8/3052Fの内蔵モジュール定義								*/
#include	"agvdef.h"								/* 無人搬送車のデバイス定義									*/

/****************************************************************************************************************/
/*	bios_ad_input関数																							*/
/****************************************************************************************************************/
unsigned char bios_ad_input()
{
	SH_PORT = SAMPLE_MODE;
	nop();
	nop();
	nop();
	nop();
	SH_PORT = HOLD_MODE;
	AD_PORT = 0x00;
	while (P8DR & 0x01);
	return(AD_PORT);
}