/****************************************************************************************************************/
/*	FILE        : bios_da_output.c																				*/
/*	DATE        :Tue, Jan 17, 2012																				*/
/*	DESCRIPTION :AGVのD/Aポートにハンドル切れ角に対応する値を出力するモジュール									*/
/*	CPU TYPE    :H8/3052F																						*/
/****************************************************************************************************************/
#include	"machine.h"								/* 組込み関数の定義											*/
#include	"reg3052.h"								/* H8/3052Fの内蔵モジュール定義								*/
#include	"agvdef.h"								/* 無人搬送車のデバイス定義									*/

/****************************************************************************************************************/
/*	bios_da_output関数																							*/
/****************************************************************************************************************/
// [外部変数]　agvdef.h:30
//            #define DA_PORT     (*(volatile unsigned char *)0xa0004)


void bios_da_output(unsigned char dig_handlecontrol)
{
    // DA_PORTにbios_da_output()の引数を入力する.
    DA_PORT = dig_handlecontrol;
}
