/****************************************************************************************************************/
/*	FILE        : bios_ad_input.c																				*/
/*	DATE        :Tue, Jan 17, 2012																				*/
/*	DESCRIPTION :AGVのハンドル切れ角をA/D変換して獲得するモジュール												*/
/*	CPU TYPE    :H8/3052F																						*/
/****************************************************************************************************************/
#include	"machine.h"								/* 組込み関数の定義											*/
#include	"reg3052.h"								/* H8/3052Fの内蔵モジュール定義								*/
#include	"agvdef.h"								/* 無人搬送車のデバイス定義									*/

/****************************************************************************************************************/
/*	bios_ad_input関数																							*/
/****************************************************************************************************************/
//レポート AD/DAの操作を参照
unsigned char bios_ad_input(void)
{
	SH_PORT = SAMPLE_MODE;
	nop();
	nop();
	nop();
	nop();
	SH_PORT = HOLD_MODE; 
	AD_PORT = 0x00; //なんでもいいので書き込むとad変換開始
	while (P8DR & 0x01); //bit0だけ見てる　p8drはda変換器の変換終了時に1になるみたい
	return(AD_PORT); //da変換結果を出力(unsigned char)
}