/*****************************************************************************************************************
/*	FILE        : itask_motor.c																					*/
/*	DATE        :Tue, Jan 17, 2012																				*/
/*	DESCRIPTION :AGVの走行管理割り込みタスク																	*/
/*	CPU TYPE    :H8/3052F																						*/
/****************************************************************************************************************/
#include	"machine.h"									/* 組込み関数の定義										*/
#include	"reg3052.h"									/* H8/3052Fの内蔵モジュール定義							*/
#include	"agvdef.h"									/* 無人搬送車のデバイス定義								*/
#include	"agvvars.h"									/* 無人搬送車の共通変数を定義							*/
#include	"def_monitor_printf.h"
#include	"Acc_Table.h"								/* 加速テーブルの読み出し								*/

/****************************************************************************************************************/
/*	走行モータ制御タスク itask_motor																			*/
/****************************************************************************************************************/
#pragma	interrupt itask_motor
void itask_motor(void)
{

}
