/*あなたのプログラムを以下にプログラムを挿入する*/
/****************************************************************************************************************/
/*  FILE        : itask_input.c                                                                                 */
/*  DATE        :Tue, Jan 17, 2012                                                                              */
/*  DESCRIPTION :AGVの入力割り込みタスク                                                                      */
/*  CPU TYPE    :H8/3052F                                                                                       */
/****************************************************************************************************************/
#include    "machine.h"                             /* 組込み関数の定義                                         */
#include    "reg3052.h"                             /* H8/3052Fの内蔵モジュール定義                               */
#include    "agvdef.h"                              /* 無人搬送車のデバイス定義                                 */
#include    "agvvars.h"                             /* 無人搬送車の共通変数を定義                                */
#include    "def_monitor_printf.h"

/****************************************************************************************************************/
/*  入力タスク itask_input                                                                                       */
/****************************************************************************************************************/
#pragma interrupt itask_input
unsigned char itask_input(void)
{
    static unsigned char sw;
    if (sw == bios_sw_input()) {
        SW_DATA = bios_sw_input();
    }
    else{
        sw = bios_sw_input();
    }
}
